Ran Plan for dir: `bruno-athaide-product-test/poc-config-v2` workspace: `default`

<details><summary>Show Output</summary>

```diff
data.configcat_products.my_products: Reading...
data.configcat_products.my_products: Read complete after 1s [id=1756126067]
data.configcat_environments.prod_environment: Reading...
data.configcat_configs.existing_configs: Reading...
data.configcat_segments.existing_segments: Reading...
data.configcat_environments.prod_environment: Read complete after 0s [id=08ddc62b-f5b3-46de-86fb-342d26c74a4d1756126068]
data.configcat_segments.existing_segments: Read complete after 0s [id=08ddc62b-f5b3-46de-86fb-342d26c74a4d1756126068]
data.configcat_configs.existing_configs: Read complete after 0s [id=08ddc62b-f5b3-46de-86fb-342d26c74a4d1756126068]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # configcat_config.my_config will be created
+ resource "configcat_config" "my_config" {
      + description        = "My config description"
      + evaluation_version = "v2"
      + id                 = (known after apply)
      + name               = "My config v2"
      + order              = 0
      + product_id         = "08ddc62b-f5b3-46de-86fb-342d26c74a4d"
    }

  # configcat_segment.my_segment will be created
+ resource "configcat_segment" "my_segment" {
      + comparator           = "sensitiveIsOneOf"
      + comparison_attribute = "email"
      + comparison_value     = "betauser1@example.com,betauser2@example.com"
      + description          = "Beta users' description"
      + id                   = (known after apply)
      + name                 = "Beta users"
      + product_id           = "08ddc62b-f5b3-46de-86fb-342d26c74a4d"
    }

  # configcat_setting.advanced_metadata_flag will be created
+ resource "configcat_setting" "advanced_metadata_flag" {
      + config_id    = "08dde199-45e7-4f42-8775-73d17fec4e3d"
      + hint         = "Testing various metadata field approaches"
      + id           = (known after apply)
      + key          = "advancedMetadataFlag"
      + name         = "Advanced Metadata Feature Flag"
      + order        = 4
      + setting_type = "string"
    }

  # configcat_setting.experimental_metadata_flag will be created
+ resource "configcat_setting" "experimental_metadata_flag" {
      + config_id    = "08dde199-45e7-4f42-8775-73d17fec4e3d"
      + hint         = "Testing experimental metadata fields to discover provider capabilities"
      + id           = (known after apply)
      + key          = "experimentalMetadataFlag"
      + name         = "Experimental Metadata Feature Flag"
      + order        = 5
      + setting_type = "string"
    }

  # configcat_setting.expiry_active_test_flag will be created
+ resource "configcat_setting" "expiry_active_test_flag" {
      + config_id    = "08dde199-45e7-4f42-8775-73d17fec4e3d"
      + hint         = "Testing expiry_date and active properties specifically"
      + id           = (known after apply)
      + key          = "expiryActiveTestFlag"
      + name         = "Expiry and Active Test Feature Flag"
      + order        = 6
      + setting_type = "boolean"
    }

  # configcat_setting.metadata_test_flag will be created
+ resource "configcat_setting" "metadata_test_flag" {
      + config_id    = "08dde199-45e7-4f42-8775-73d17fec4e3d"
      + hint         = "Testing extra metadata fields like expiry_date and active status"
      + id           = (known after apply)
      + key          = "metadataTestFlag"
      + name         = "Metadata Test Feature Flag"
      + order        = 3
      + setting_type = "boolean"
    }

  # configcat_setting.my_bool_setting_v2 will be created
+ resource "configcat_setting" "my_bool_setting_v2" {
      + config_id    = "08dde199-45e7-4f42-8775-73d17fec4e3d"
      + hint         = (known after apply)
      + id           = (known after apply)
      + key          = "BoolSettingKey"
      + name         = "Bool feature flag"
      + order        = 1
      + setting_type = "boolean"
    }

  # configcat_setting.my_string_setting_v2 will be created
+ resource "configcat_setting" "my_string_setting_v2" {
      + config_id    = "08dde199-45e7-4f42-8775-73d17fec4e3d"
      + hint         = (known after apply)
      + id           = (known after apply)
      + key          = "StringSettingKey"
      + name         = "String setting"
      + order        = 2
      + setting_type = "string"
    }

  # configcat_setting_value_v2.advanced_metadata_flag_value will be created
+ resource "configcat_setting_value_v2" "advanced_metadata_flag_value" {
      + environment_id  = "08ddc62c-0cc2-43e7-8f61-400953081bfe"
      + id              = (known after apply)
      + init_only       = true
      + mandatory_notes = "METADATA: {\"expiry_date\": \"2024-12-31\", \"active\": true, \"priority\": \"high\", \"owner\": \"qa-team\"}"
      + setting_id      = (known after apply)
      + setting_type    = (known after apply)
      + targeting_rules = [
          + {
              + conditions = [
                  + {
                      + user_condition = {
                          + comparator           = "sensitiveTextEquals"
                          + comparison_attribute = "email"
                          + comparison_value     = {
                              + string_value = "@configcat.com"
                            }
                        }
                    },
                ]
              + value      = {
                  + string_value = "internal_value"
                }
            },
        ]
      + value           = {
          + string_value = "default_value"
        }
    }

  # configcat_setting_value_v2.bool_setting_value will be created
+ resource "configcat_setting_value_v2" "bool_setting_value" {
      + environment_id  = "08ddc62c-0cc2-43e7-8f61-400953081bfe"
      + id              = (known after apply)
      + init_only       = true
      + mandatory_notes = "mandatory notes"
      + setting_id      = (known after apply)
      + setting_type    = (known after apply)
      + targeting_rules = [
          + {
              + conditions = [
                  + {
                      + user_condition = {
                          + comparator           = "sensitiveTextEquals"
                          + comparison_attribute = "email"
                          + comparison_value     = {
                              + string_value = "@configcat.com"
                            }
                        }
                    },
                  + {
                      + user_condition = {
                          + comparator           = "isOneOf"
                          + comparison_attribute = "color"
                          + comparison_value     = {
                              + list_values = [
                                  + {
                                      + hint  = "black"
                                      + value = "#000000"
                                    },
                                  + {
                                      + value = "red"
                                    },
                                ]
                            }
                        }
                    },
                  + {
                      + segment_condition = {
                          + comparator = "isIn"
                          + segment_id = "08dde199-45b9-4bba-81ca-35544c64b56b"
                        }
                    },
                  + {
                      + prerequisite_flag_condition = {
                          + comparator              = "doesNotEqual"
                          + comparison_value        = {
                              + string_value = "test"
                            }
                          + prerequisite_setting_id = (known after apply)
                        }
                    },
                ]
              + value      = {
                  + bool_value = true
                }
            },
          + {
              + conditions         = [
                  + {
                      + user_condition = {
                          + comparator           = "sensitiveTextEquals"
                          + comparison_attribute = "county"
                          + comparison_value     = {
                              + string_value = "Hungary"
                            }
                        }
                    },
                ]
              + percentage_options = [
                  + {
                      + percentage = 50
                      + value      = {
                          + bool_value = true
                        }
                    },
                  + {
                      + percentage = 50
                      + value      = {
                          + bool_value = false
                        }
                    },
                ]
            },
          + {
              + percentage_options = [
                  + {
                      + percentage = 30
                      + value      = {
                          + bool_value = true
                        }
                    },
                  + {
                      + percentage = 70
                      + value      = {
                          + bool_value = false
                        }
                    },
                ]
            },
        ]
      + value           = {
          + bool_value = true
        }
    }

  # configcat_setting_value_v2.experimental_metadata_flag_value will be created
+ resource "configcat_setting_value_v2" "experimental_metadata_flag_value" {
      + environment_id  = "08ddc62c-0cc2-43e7-8f61-400953081bfe"
      + id              = (known after apply)
      + init_only       = true
      + mandatory_notes = "EXPERIMENTAL_METADATA: {\"expiry_date\": \"2024-12-31\", \"active\": true, \"priority\": \"high\", \"owner\": \"qa-team\", \"created_by\": \"terraform\", \"environment\": \"production\", \"version\": \"1.0.0\"}"
      + setting_id      = (known after apply)
      + setting_type    = (known after apply)
      + targeting_rules = [
          + {
              + conditions = [
                  + {
                      + user_condition = {
                          + comparator           = "sensitiveTextEquals"
                          + comparison_attribute = "email"
                          + comparison_value     = {
                              + string_value = "@configcat.com"
                            }
                        }
                    },
                ]
              + value      = {
                  + string_value = "experimental_internal_value"
                }
            },
        ]
      + value           = {
          + string_value = "experimental_value"
        }
    }

  # configcat_setting_value_v2.expiry_active_test_flag_value will be created
+ resource "configcat_setting_value_v2" "expiry_active_test_flag_value" {
      + environment_id  = "08ddc62c-0cc2-43e7-8f61-400953081bfe"
      + id              = (known after apply)
      + init_only       = true
      + mandatory_notes = "EXPIRY_DATE: 2024-12-31T23:59:59Z, ACTIVE: true, PRIORITY: high, OWNER: qa-team, CREATED: 2024-01-01, EXPIRES: 2024-12-31"
      + setting_id      = (known after apply)
      + setting_type    = (known after apply)
      + targeting_rules = [
          + {
              + conditions = [
                  + {
                      + user_condition = {
                          + comparator           = "sensitiveTextEquals"
                          + comparison_attribute = "email"
                          + comparison_value     = {
                              + string_value = "@configcat.com"
                            }
                        }
                    },
                ]
              + value      = {
                  + bool_value = false
                }
            },
        ]
      + value           = {
          + bool_value = true
        }
    }

  # configcat_setting_value_v2.metadata_test_flag_value will be created
+ resource "configcat_setting_value_v2" "metadata_test_flag_value" {
      + environment_id  = "08ddc62c-0cc2-43e7-8f61-400953081bfe"
      + id              = (known after apply)
      + init_only       = true
      + mandatory_notes = "Testing metadata capabilities - expiry: 2024-12-31, active: true"
      + setting_id      = (known after apply)
      + setting_type    = (known after apply)
      + targeting_rules = [
          + {
              + conditions = [
                  + {
                      + user_condition = {
                          + comparator           = "sensitiveTextEquals"
                          + comparison_attribute = "email"
                          + comparison_value     = {
                              + string_value = "@configcat.com"
                            }
                        }
                    },
                ]
              + value      = {
                  + bool_value = false
                }
            },
        ]
      + value           = {
          + bool_value = true
        }
    }

  # configcat_setting_value_v2.string_setting_value will be created
+ resource "configcat_setting_value_v2" "string_setting_value" {
      + environment_id  = "08ddc62c-0cc2-43e7-8f61-400953081bfe"
      + id              = (known after apply)
      + init_only       = true
      + setting_id      = (known after apply)
      + setting_type    = (known after apply)
      + targeting_rules = [
          + {
              + conditions = [
                  + {
                      + user_condition = {
                          + comparator           = "sensitiveTextEquals"
                          + comparison_attribute = "email"
                          + comparison_value     = {
                              + string_value = "@configcat.com"
                            }
                        }
                    },
                ]
              + value      = {
                  + string_value = "custom"
                }
            },
        ]
      + value           = {
          + string_value = "test"
        }
    }

Plan: 14 to add, 0 to change, 0 to destroy.
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -d bruno-athaide-product-test/poc-config-v2
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://617d36dbbc68.ngrok-free.app/lock?id=caioq%252Fpoc-configcat-atlantis%252Fbruno-athaide-product-test%252Fpoc-config-v2%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -d bruno-athaide-product-test/poc-config-v2
  ```
Plan: 14 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```